app/controllers/restaurants_controller.rb

  def index
    @restaurants = Restaurant.all
---
SELECT `restaurants`.* FROM `restaurants`

  def create
    @restaurant = Restaurant.new(restaurant_params)

    respond_to do |format|
      if @restaurant.save
---
INSERT INTO `restaurants` (`name`, `address`, `desc`, `created_at`, `updated_at`) VALUES ('nazivs', 'sdfdsf', 'tralalala', '2016-02-10 21:04:27', '2016-02-10 21:04:27')

  def destroy
    @restaurant.destroy
---
DELETE FROM `restaurants` WHERE `restaurants`.`id` = 1

    def set_restaurant
      @restaurant = Restaurant.find(params[:id])
---
SELECT  `restaurants`.* FROM `restaurants` WHERE `restaurants`.`id` = 1 LIMIT 1